       program-id. cobol-visual.

       environment division.
       configuration section.

       data division.
       working-storage section.
       linkage section.

       procedure division.
           display "Hola COBOL".
           goback.

       end program cobol-visual.
