IDENTIFICATION DIVISION.
PROGRAM-ID. Hola_Satan.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
MAIN-PROCEDURE.
    DISPLAY "Hola Satan".
    STOP RUN.
END PROGRAM Hola_Satan.